# словарь, в котором храним преобразуем название месяца в любом виде в его номер
months_dict = {
    '1': 1, 'январь': 1, 'января': 1,
    '2': 2, 'февраль': 2, 'февраля': 2,
    '3': 3, 'март': 3, 'марта': 3,
    '4': 4, 'апрель': 4, 'апреля': 4,
    '5': 5, 'май': 5, 'мая': 5,
    '6': 6, 'июнь': 6, 'июня': 6,
    '7': 7, 'июль': 7, 'июля': 7,
    '8': 8, 'август': 8, 'августа': 8,
    '9': 9, 'сентябрь': 9, 'сентября': 9,
    '10': 10, 'октябрь': 10, 'октября': 10,
    '11': 11, 'ноябрь': 11, 'ноября': 11,
    '12': 12, 'декабрь': 12, 'декабря': 12,
}
